Repository: nblaisot/nom_de_ton_app
Catalog: lib/l10n/app_*.arb
Languages: fr

source: Library
fr: Bibliothèque

source: Import EPUB
fr: Importer EPUB

source: Importing...
fr: Importation...

source: Importing EPUB...
fr: Importation de l'EPUB...

source: Book imported successfully!
fr: Livre importé avec succès !

# errorImportingBook
source: Error importing book: {error}
fr: Erreur lors de l'importation du livre : {error}

# errorLoadingBooks
source: Error loading books: {error}
fr: Erreur lors du chargement des livres : {error}

# noBooksInLibrary
source: No books in your library
fr: Aucun livre dans votre bibliothèque

# tapToImportEpub
source: Tap the + button to import an EPUB
fr: Appuyez sur le bouton + pour importer un EPUB

source: Delete Book
fr: Supprimer le livre

# confirmDeleteBook
source: Are you sure you want to delete "{title}"?
fr: Êtes-vous sûr de vouloir supprimer "{title}" ?

source: Cancel
fr: Annuler

source: Delete
fr: Supprimer

# bookDeleted
source: "{title}" deleted
fr: "{title}" supprimé

# errorDeletingBook
source: Error deleting book: {error}
fr: Erreur lors de la suppression du livre : {error}

source: Refresh
fr: Actualiser

# libraryShowGrid
source: Grid view
fr: Vue grille

# libraryShowList
source: List view
fr: Vue liste

source: Retry
fr: Réessayer

source: Chapters
fr: Chapitres

source: Table of Contents
fr: Table des matières

# chapter
source: Chapter {number}
fr: Chapitre {number}

source: Go to Page
fr: Aller à la page

# goToPercentage
source: Go to % progress
fr: Aller à % de progression

# enterPercentage
source: Enter progress percentage (0-100)
fr: Entrez un pourcentage de progression (0-100)

# invalidPercentage
source: Please enter a value between 0 and 100
fr: Veuillez saisir une valeur entre 0 et 100

source: Summary
fr: Résumé

source: Back to Library
fr: Retour à la bibliothèque

# enterPageNumber
source: Enter page number (1-{max})
fr: Entrez le numéro de page (1-{max})

source: Go
fr: Aller

# invalidPageNumber
source: Please enter a page number between 1 and {max}
fr: Veuillez entrer un numéro de page entre 1 et {max}

source: No pages available
fr: Aucune page disponible

source: No chapters available
fr: Aucun chapitre disponible

source: Reset summaries
fr: Réinitialiser

source: Summaries reset
fr: Résumés réinitialisés

# resetSummariesError
source: Unable to reset summaries. Please try again.
fr: Impossible de réinitialiser les résumés. Veuillez réessayer.

# summaryFeatureComingSoon
source: Summary feature will be implemented later with LLM integration.
fr: La fonctionnalité de résumé sera implémentée plus tard avec l'intégration LLM.

# errorLoadingBook
source: Error loading book: {error}
fr: Erreur lors du chargement du livre : {error}

# loadingBook
source: Loading {title}...
fr: Chargement de {title}...

# errorLoadingBookTitle
source: Error Loading Book
fr: Erreur lors du chargement du livre

# noContentAvailable
source: No content available in this book.
fr: Aucun contenu disponible dans ce livre.

source: End of book reached
fr: Fin du livre atteinte

source: Beginning of book
fr: Début du livre

source: Invalid chapter index
fr: Index de chapitre invalide

# errorLoadingChapter
source: Error loading chapter: {error}
fr: Erreur lors du chargement du chapitre : {error}

# chapterInfo
source: Chapter {current}/{total}
fr: Chapitre {current}/{total}

# thisChapterHasPages
source: This chapter has {count} page
fr: Ce chapitre contient {count} page

# thisChapterHasPages_plural
source: This chapter has {count} pages
fr: Ce chapitre contient {count} pages

source: Settings
fr: Paramètres

source: Summary Provider
fr: Fournisseur de résumés

# summaryProviderDescription
source: Choose how summaries are generated
fr: Choisissez comment les résumés sont générés

# summaryProviderMissing
source: Configure a summary provider in Settings to generate summaries.
fr: Configurez un fournisseur de résumés dans les paramètres pour générer des résumés.

source: Prompt Settings
fr: Paramètres des prompts

# promptSettingsDescription
source: Customize the prompts used for summary generation. You can use placeholders in your prompts: text (for the text to summarize), bookTitle (for the book title), and chapterTitle (for the chapter title). Write them with curly braces in your prompts.
fr: Personnalisez les prompts utilisés pour la génération de résumés. Vous pouvez utiliser des placeholders dans vos prompts : text (pour le texte à résumer), bookTitle (pour le titre du livre), et chapterTitle (pour le titre du chapitre). Écrivez-les avec des accolades dans vos prompts.

# textSelectionActionSettings
source: Text selection action
fr: Action de sélection de texte

# textSelectionActionDescription
source: Customize the action displayed when selecting text. You can use {text} for the selected text and {language} for the application language.
fr: Personnalisez l'action affichée lors de la sélection de texte. Vous pouvez utiliser {text} pour le texte sélectionné et {language} pour la langue de l'application.

# textSelectionActionLabelFr
source: Action label (French)
fr: Libellé de l'action (français)

# textSelectionActionLabelEn
source: Action label (English)
fr: Libellé de l'action (anglais)

# textSelectionActionPromptFr
source: Action prompt (French)
fr: Invite de l'action (français)

# textSelectionActionPromptEn
source: Action prompt (English)
fr: Invite de l'action (anglais)

# textSelectionActionProcessing
source: Processing selection...
fr: Traitement de la sélection...

# textSelectionActionError
source: Unable to process the selected text.
fr: Impossible de traiter le texte sélectionné.

# textSelectionSelectedTextLabel
source: Selected text
fr: Texte sélectionné

# textSelectionActionResultLabel
source: Response
fr: Réponse

# textSelectionDefaultLabel
source: Translate
fr: Traduire

# summaryConfigurationRequiredTitle
source: Configuration required
fr: Configuration requise

# summaryConfigurationRequiredBody
source: To use this feature you need to configure an AI provider in the settings. Would you like to open the settings now?
fr: Pour utiliser cette fonctionnalité, vous devez configurer un fournisseur d'IA dans les paramètres. Voulez-vous ouvrir les paramètres maintenant ?

# appLanguageName
source: English
fr: Français

source: Chunk Summary Prompt
fr: Prompt de résumé de chunk

# chunkSummaryPromptFr
source: Chunk Summary Prompt (French)
fr: Prompt de résumé de chunk (Français)

# chunkSummaryPromptEn
source: Chunk Summary Prompt (English)
fr: Prompt de résumé de chunk (Anglais)

source: Character Extraction Prompt
fr: Prompt d'extraction de personnages

# characterExtractionPromptFr
source: Character Extraction Prompt (French)
fr: Prompt d'extraction de personnages (Français)

# characterExtractionPromptEn
source: Character Extraction Prompt (English)
fr: Prompt d'extraction de personnages (Anglais)

source: Batch Summary Prompt
fr: Prompt de résumé par batch

# batchSummaryPromptFr
source: Batch Summary Prompt (French)
fr: Prompt de résumé par batch (Français)

# batchSummaryPromptEn
source: Batch Summary Prompt (English)
fr: Prompt de résumé par batch (Anglais)

source: Narrative Synthesis Prompt
fr: Prompt de synthèse narrative

# narrativeSynthesisPromptFr
source: Narrative Synthesis Prompt (French)
fr: Prompt de synthèse narrative (Français)

# narrativeSynthesisPromptEn
source: Narrative Synthesis Prompt (English)
fr: Prompt de synthèse narrative (Anglais)

source: Fallback Summary Prompt
fr: Prompt de résumé de fallback

# fallbackSummaryPromptFr
source: Fallback Summary Prompt (French)
fr: Prompt de résumé de fallback (Français)

# fallbackSummaryPromptEn
source: Fallback Summary Prompt (English)
fr: Prompt de résumé de fallback (Anglais)

source: Concise Summary Prompt
fr: Prompt de résumé concis

# conciseSummaryPromptFr
source: Concise Summary Prompt (French)
fr: Prompt de résumé concis (Français)

# conciseSummaryPromptEn
source: Concise Summary Prompt (English)
fr: Prompt de résumé concis (Anglais)

# resetPrompts
source: Reset to Default
fr: Réinitialiser aux valeurs par défaut

# promptsReset
source: Prompts reset to default values
fr: Prompts réinitialisés aux valeurs par défaut

source: Prompt saved
fr: Prompt enregistré

# openAIModelConfigured
source: Configured - Requires internet
fr: Configuré - Nécessite Internet

# openAIModelNotConfigured
source: Not configured - API key required
fr: Non configuré - Clé API requise

source: OpenAI Settings
fr: Paramètres OpenAI

# openAISettingsDescription
source: Enter your OpenAI API key to use GPT for summaries
fr: Entrez votre clé API OpenAI pour utiliser GPT pour les résumés

source: OpenAI API Key
fr: Clé API OpenAI

# enterOpenAIApiKey
source: Enter your OpenAI API key
fr: Entrez votre clé API OpenAI

source: Save API Key
fr: Enregistrer la clé API

# apiKeyRequired
source: API key is required
fr: La clé API est requise

source: Settings saved
fr: Paramètres enregistrés

source: Error saving settings
fr: Erreur lors de l'enregistrement des paramètres

# summarySettingsInfo
source: OpenAI and Mistral AI provide fast and accurate summaries but require an internet connection and API key. Configure your preferred provider and customize the prompts used for summary generation.
fr: OpenAI et Mistral AI fournissent des résumés rapides et précis mais nécessitent une connexion Internet et une clé API. Configurez votre fournisseur préféré et personnalisez les prompts utilisés pour la génération de résumés.

source: Generating summary...
fr: Génération du résumé...

# errorGeneratingSummary
source: Error generating summary: {error}
fr: Erreur lors de la génération du résumé : {error}

# summaryForChapter
source: Summary for {title}
fr: Résumé pour {title}

source: No summary available
fr: Aucun résumé disponible

# deleteBookConfirm
source: This will delete the book from the library. Are you sure?
fr: Cela supprimera le livre de la bibliothèque. Êtes-vous sûr ?

source: Confirm
fr: Confirmer

source: Text size
fr: Taille du texte

source: Language
fr: Langue

# languageDescription
source: Choose your preferred language. Changes require app restart.
fr: Choisissez votre langue préférée. Les modifications nécessitent un redémarrage de l'application.

# languageSystemDefault
source: System Default
fr: Par défaut (système)

# languageSystemDefaultDescription
source: Use device language settings
fr: Utiliser les paramètres de langue de l'appareil

# languageChangedRestart
source: Language preference saved. Please restart the app for changes to take effect.
fr: Préférence de langue enregistrée. Veuillez redémarrer l'application pour que les modifications prennent effet.

# languageEnglish
source: English
fr: Anglais

# languageFrench
source: French
fr: Français

# summaryFromBeginning
source: From the Beginning
fr: Depuis le début

# summarySinceLastTime
source: Last Reading
fr: Depuis la dernière fois

# summaryCharacters
source: Characters
fr: Personnages

# horizontalPaddingSaved
source: Horizontal padding saved. Changes will apply when you reopen a book.
fr: Padding horizontal enregistré. Les modifications s'appliqueront lors de la réouverture d'un livre.

# verticalPaddingSaved
source: Vertical padding saved. Changes will apply when you reopen a book.
fr: Padding vertical enregistré. Les modifications s'appliqueront lors de la réouverture d'un livre.
